        02  HID1.
            03  HID1-FIXED1.
              04  HID1-ID1CODE.
                05  HID1-VALUE  PIC X(11).
              04  HID1-ID1MSG.
                05  HID1-VALUE  PIC X(71).
